Term4/teorver/practice/6.tex
% Created 2021-03-16 Tue 13:00
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Практика 6}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Практика 6},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{task}
На \(m\) студентов имеются \(m\) билетов на экзамене. Студент выучил
один билет. Каким по очереди нужно идти на экзамен, чтобы вероятность
его сдать была наибольшей.
\end{task}
\begin{solution}
\-
\begin{itemize}
\item \(A_k\) --- выбран нужный билет, \(k\)-тый в очереди
\end{itemize}
\[ P(A_{k + 1}) = \frac{C^k_{m - 1}}{C^k_m}\cdot\frac{1}{m - k} = \frac{(m - 1)!\cdot k! (m - k)!}{k!(m - 1 - k)!\cdot(m!)} \cdot \frac{1}{m - k} = \frac{m - k}{m}\cdot\frac{1}{m - k} = \frac{1}{m}\]
\end{solution}

\begin{task}
Вероятность бракованной детали \(\frac{1}{100}\). Имеется 5 партий по
100 деталей. Какова вероятность того, что в двух партиях будет ровно
по 2 бранованных деталей.
\end{task}
\begin{solution}
\-
\begin{itemize}
\item \(p = 0.001\)
\item \(n = 100\)
\item \(\lambda = np = 1\)
\end{itemize}
Формула Пуассона:
\[ P_100(2) = \frac{\lambda^2}{2!}e^{-\lambda} = \frac{1}{2}e^{-1} = 0.1839 \]
\begin{itemize}
\item \(p = 0.1839\)
\item \(n = 5\)
\item \(q = 0.8161\)
\end{itemize}
Формула Бернулли:
\[ P_5(2) = C^2_5p^2q^3 = 0.1837 \]
\end{solution}
\begin{task}
Три орудия производят стрельбу по трем целям. Каждое орудие выбирает
себе цель случайным образом и независимо от других. Цель, обстрелянная
одним орудием, поражается с вероятностью \(p\). Найти вероятность
того, что из трех целей две будут поражены, а третья нет.
\end{task}
\begin{solution}
\-
\begin{itemize}
\item \(H_1\) --- выбрана одна цель
\item \(H_2\) --- две цели
\item \(H_3\) --- три цели
\item \(p = \frac{1}{3}\)
\item \(q = 1 - p\)
\end{itemize}
По формуле полной вероятности:
\[ P(A|H_1) =  0 \]
\[ P(A|H_2) =  \]
\[ P(A|H_3) = C^2_3 p^2 q \]

\[ P(H_1) = C^1_3 \cdot p^3 \]
\[ P(H_2) = C^2_3 \cdot2\cdot2 \cdot p^3 \]
\[ P(H_3) = 3! \cdot p^3 \]
\end{solution}
\end{document}
